/**
 * 用户协议
 */
export default {
    
    /*
    ** 获取用户协议
    **
    */
    getUserProtocol(){
        let up=`雅耀依据本协议的规定提供服务，本协议具有合同效力。您必须完全同意本协议，才能够享受本网站提供的服务。您在雅耀注册成功即表示您完全接受本协议的全部条款。注册用户时请您认真阅读本《雅耀用户服务协议》，请您审阅并接受或不接受本《协议》（未成年人应在法定监护人陪同下审阅）。除非您接受本《协议》条款，否则您无权使用本网站提供的相关服务。您的使用行为将视为对本《协议》的接受，并同意接受本《协议》各项条款的约束。
        一、定义
        在本协议中所使用的下列词语，除非另有定义，应具有以下含义：
        1、 "本网站"在无特别说明的情况下，均指"雅耀"（www.shenzan.com）。
        2、 "用户"指符合本协议所规定的条件，同意遵守本网站各种规则、条款（包括但不限于本协议），并使用本网站的个人或机构。 
        二、用户资格
        1、只有符合下列条件之一的人员或实体才能申请成为本网站用户，可以使用本网站的服务。
            (1) 年满十八岁，并具有民事权利能力和民事行为能力的自然人；
            (2) 未满十八岁，但监护人（包括但不仅限于父母）予以书面同意的自然人；
        2、根据中国法律或设立地法律、法规和/或规章成立并合法存在的公司、企事业单位、社团组织和其他组织。无民事行为能力人、限制民事行为能力人以及无经营或特定经营资格的组织不当注册为本网站用户或超过其民事权利或行为能力范围从事交易的，其与本网站之间的协议自始无效，本网站一经发现，有权立即注销该用户，并追究其使用本网站"服务"的一切法律责任。
        3、 用户必须有明确的联系地址和联系电话，并提供真实姓名或公司名称。
        三、用户的权利和义务 
        1、用户有权根据本协议的规定及本网站发布的相关规则，利用本网站网上交易平台发布任务信息、查询用户信息、参加任务、在本网站社区发帖、参加本网站的有关活动及有权享受本网站提供的其他的有关资讯及信息服务。
        2、用户有权根据需要更改登录和账户提现密码。用户应对以该用户名进行的所有活动和事件负全部责任。
        3、用户有义务确保向本网站提供的任何资料、注册信息真实准确，包括但不限于真实姓名、身份证号、联系电话、地址、邮政编码等。保证本网站可以通过上述联系方式与自己进行联系。同时，用户也有义务在相关资料实际变更时及时更新有关注册资料。 
        4、用户不得以任何形式擅自转让或授权他人使用自己在本网站的用户帐号。
        5、用户有义务确保在本网站网上交易平台上发布的任务信息真实、准确，无误导性。
        6、用户不得在本网站网上发布平台发布国家禁止信息、不得发布侵犯他人知识产权或其他合法权益的信息，也不得发布违背社会公共利益或公共道德的信息。
        7、用户在本网站交易中应当遵守诚实信用原则，不得以干预或操纵发布任务等不正当竞争方式扰乱网上交易秩序，不得从事与网上交易无关的不当行为，不得在交易平台上发布任何违法信息。
        8、用户不应采取不正当手段（包括但不限于虚假信息、互换好评等方式）提高自身或他人信用度，或采用不正当手段恶意评价其他用户，降低其他用户信用度。
        9、用户承诺自己在使用本网站网上交易平台实施的所有行为遵守国家法律、法规和本网站的相关规定以及各种社会公共利益或公共道德。对于任何法律后果的发生，用户将以自己的名义独立承担所有相应的法律责任。
        10、用户在本网站网上交易过程中如与其他用户因交易产生纠纷，可以请求本网站从中予以协调。用户如发现其他用户有违法或违反本协议的行为，可以向本网站举报。如用户因网上交易与其他用户产生诉讼的，用户有权通过司法部门要求本网站提供相关资料。
        11、用户应自行承担因交易产生的相关费用，并依法纳税。
        12、未经本网站书面允许，用户不得将本网站资料以及在交易平台上所展示的任何信息以复制、修改、翻译等形式制作衍生作品、分发或公开展示。
        13、用户不得使用以下方式登录网站或破坏网站所提供的服务：
            (1) 以任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件或其它自动方式访问或登录本网站；
            (2) 通过任何方式对本公司内部结构造成或可能造成不合理或不合比例的重大负荷的行为；
            (3) 通过任何方式干扰或试图干扰网站的正常工作或网站上进行的任何活动； 
        14、用户同意接收来自本网站的信息，包括但不限于活动信息、交易信息、促销信息等。
        15、用户使用规范
        a、用户应保证自己的微博账号只发布合法、合规、合情的内容，不涉及以下内容：
        1）违反国家宪法所确定的基本原则的内容；
        2）出现危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的内容；
        3）涉黄、涉政、含有个人极端言论的内容；
        4）使用损害国家荣誉和利益的内容；
        5）使用煽动民族仇恨、民族歧视，破坏民族团结的内容；
        6）使用破坏国家宗教政策，宣扬邪教和封建迷信的内容；
        7）散布谣言，扰乱社会秩序，破坏社会稳定的内容；
        8）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的内容；
        9）使用中华人民共和国国旗、国徽、国歌；
        10）使用国家机关和国家机关工作人员的名义；
        11）使用国家级、最高级、最佳等用语；
        12）出现妨碍社会安定和危害人身、财产安全，损害社会公共利益的言论；
        13）使用妨碍社会公共秩序和违背社会良好风尚的内容；
        14）涉及近期敏感言论和敏感活动，抨击他人的产品或广告，进行负面推广；
        15）使用、发布涉及法律、行政法规规定禁止的其他内容；
        一旦雅耀发现用户发布以上违法内容，雅耀平台有权利向公安、工商等相关政府机关举报，其后果由用户自行承担。自用户发布违法内容起，视为用户违约，雅耀相应的不再承担本服务条款下的义务。
        特别提醒：对于涉及知名品牌的商品，请用户仔细查阅商家提供的相关正品证明，并自行判断是否发送；若用户未能仔细审查而发布了不实信息，由此带来不良后果，用户应承担相应责任，与雅耀平台无关。
        1、如用户违反国家法律法规、本服务条款或对本网站进行恶意攻击时，本网站将有权停止向用户提供服务而不需承担任何责任，如导致本网站遭受任何损害或遭受任何来自第三方的纠纷、诉讼、索赔要求,用户须向本公司赔偿相应的损失，如诉讼费、律师费、其他第三方费用、业务影响损失等费用，并且用户需对其违反服务条款所产生的一切后果负全部法律责任。
        四、雅耀的权利和义务 
        1、本网站仅为用户提供一个交易平台，用户必须保证所有信息真实有效合法；
        2、本网站有义务在现有技术水平的基础上努力确保整个网上交易交流平台的正常运行，尽力避免服务中断或将中断时间限制在最短时间内，保证用户网上交易交流活动的顺利进行。
        3、本网站有义务对用户在注册使用本网站网上信息平台中所遇到的问题及反映的情况及时作出回复。
        4、本网站有权对用户的注册资料进行查阅，对存在任何问题或怀疑的注册资料，本网站有权发出通知询问用户并要求用户做出解释、改正，或不通知用户直接做出处罚、删除信息、删除账号等处理。
        5、用户因在本网站网上交易与其他用户产生纠纷的，用户通过司法部门或行政部门依照法定程序要求本网站提供相关资料，本网站将积极配合并提供有关资料；用户将纠纷告知本网站，或本网站知悉纠纷情况的，经审核后，本网站有权通过电子邮件及电话联系向纠纷双方了解纠纷情况，并将所了解的情况通过电子邮件互相通知对方。
        6、因网上信息平台的特殊性，本网站没有义务对所有用户的注册资料、所有的交易行为以及与交易有关的其他事项进行事先审查，但如发生以下情形，本网站有权限制用户的活动、向用户核实有关资料、发出警告通知、暂时中止、无限期地中止及拒绝向该用户提供服务：
            (1) 用户违反本协议或因被提及而纳入本协议的文件；
            (2) 存在用户或其他第三方通知本网站，认为某个用户或具体交易事项存在违法或不当行为，并提供相关证据，而本网站无法联系到该用户核证或验证该用户向本网站提供的任何资料；
            (3) 存在用户或其他第三方通知本网站，认为某个用户或具体交易事项存在违法或不当行为，并提供相关证据。本网站以普通非专业交易者的知识水平标准对相关内容进行判别，可以明显认为这些内容或行为可能对本网站用户或本网站造成财务损失或法律责任。
        7、根据国家法律法规、本协议的内容和本网站所掌握的事实依据，可以认定用户存在违法或违反本协议行为以及在本网站交易平台上的其他不当行为，本网站有权在本网站交易平台及所在网站上以网络发布形式公布用户的违法行为，并有权随时作出删除相关信息、终止服务提供等处理，而无须征得用户的同意。 
        8、本网站有权在不通知用户的前提下删除或采取其他限制性措施处理下列信息：包括但不限于以规避费用为目的；以炒作信用为目的；存在欺诈等恶意或虚假内容；与网上交易无关或不是以交易为目的；存在恶意竞价或其他试图扰乱正常交易秩序因素；该信息违反公共利益或可能严重损害本网站和其他用户合法利益的。
        五、费用及支付方式
        1. 客户将需支付给本网站的推广费用预先充值到客户在本网站的账户中，该费用将用于向本网站支付服务费用；本网站有权从客户账户扣除客户产生的服务费用，客户需在本网站执行推广服务前向其支付每笔订单推广金额的100%。
        2. 如客户预付费用余额不足，本网站系统将自动暂停推广服务；客户续费之后再启动服务。
        3. 符合开票资格的，本网站可在客户付款后为客户开具相应金额的合法有效的增值税发票。
        4. 如客户未按照规定按时付款，或违反其在本协议项下的任何义务，本网站有权立即停止向客户提供本协议项下全部服务并解除本合同，同时本网站无需承担任何法律责任。
        5. 本网站不退还信息费，客户有权继续使用已充值但未使用完的账户余额。 
        六、服务的中断和终止 
        1、在本网站未向用户收取相关服务费用的情况下，本网站可自行全权决定以任何理由 (包括但不限于本网站认为用户已违反本协议的字面意义和精神，或用户在超过180天内未登录本网站等) 终止对用户的服务，并不再保存用户在本网站的全部资料（包括但不限于用户信息、商品信息、交易信息等）。同时本网站可自行全权决定，在发出通知或不发出通知的情况下，随时停止提供全部或部分服务。服务终止后，本网站没有义务为用户保留原用户资料或与之相关的任何信息，或转发任何未曾阅读或发送的信息给用户或第三方。
        2、如用户向本网站提出注销本网站注册用户身份，需经本网站审核同意，由本网站注销该注册用户，用户即解除与本网站的协议关系，但本网站仍保留下列权利：
            (1) 用户注销后，本网站有权保留该用户的资料,包括但不限于以前的用户资料、交易记录等。
            (2) 用户注销后，如用户在注销前在本网站交易平台上存在违法行为或违反本协议的行为，本网站仍可行使本协议所规定的权利。 
        3、如存在下列情况，本网站可以通过注销用户的方式终止服务： 
            (1) 在用户违反本协议相关规定时，本网站有权终止向该用户提供服务。本网站将在中断服务时通知用户。但如该用户在被本网站终止提供服务后，再一次直接或间接或以他人名义注册为本网站用户的，本网站有权再次单方面终止为该用户提供服务；
            (2) 一旦本网站发现用户注册资料中主要内容是虚假的，本网站有权随时终止为该用户提供服务； 
            (3) 用户出现作弊行为，网站可根据情况作出处理，甚至注销用户。
        4、其它本网站认为需终止服务的情况。
        七、本网站的责任范围
        当用户接受该协议时，用户应明确了解并同意∶
        1、用户使用本网站之风险由用户个人负担。本网站是在现有技术基础上提供的。本网站不保证以下事项∶
            (1) 本网站将符合用户的要求。
            (2) 本网站不受干扰、能够及时提供、安全可靠或免于出错。
            (3) 本服务使用权的取得结果是正确或可靠的。
        2、是否经由本网站下载或取得任何资料，由用户自行考虑、衡量并且自负风险，因下载任何资料而导致用户电脑系统的任何损坏或资料流失，用户应负完全责任。
        3、用户经由本网站取得的建议和资讯，无论其形式或表现，绝不构成本协议未明示规定的任何保证。
        4、基于以下原因而造成的利润、商誉、使用、资料损失或其它无形损失，本网站不承担任何直接、间接、附带、特别、衍生性或惩罚性赔偿（即使本网站已被告知前款赔偿的可能性）：
            (1) 本网站的使用或无法使用。 
            (2) 用户的传输或资料遭到未获授权的存取或变更。
            (3) 本网站中任何第三方之声明或行为。
            (4) 本网站其它相关事宜。
        5、本网站只是为用户提供一个服务交易的平台，对于用户所发布的任务和合法性、真实性及其品质，以及用户履行交易的能力等，本网站一律不负任何担保责任。用户如果因使用本网站，或因购买刊登于本网站的任何物品，而受有损害时，本网站不负任何补偿或赔偿责任。
        6、本网站提供与其它互联网上的网站或资源的链接，用户可能会因此连结至其它运营商经营的网站，但不表示本网站与这些运营商有任何关系。其它运营商经营的网站均由各经营者自行负责，不属于本网站控制及负责范围之内。对于存在或来源于此类网站或资源的任何内容、广告、产品或其它资料，本网站亦不予保证或负责。因使用或依赖任何此类网站或资源发布的或经由此类网站或资源获得的任何内容、物品或服务所产生的任何损害或损失，本网站不负任何直接或间接的责任。
        八、知识产权
        1、本网站及本网站所使用的任何相关软件、程序、内容，包括但不限于作品、图片、档案、资料、网站构架、网站版面的安排、网页设计、经由本网站或广告商向用户呈现的广告或资讯，均由本网站或其它权利人依法享有相应的知识产权，包括但不限于著作权、商标权、专利权或其它专属权利等，受到相关法律的保护。未经本网站或权利人明示授权，用户保证不修改、出租、出借、出售、散布本网站及本网站所使用的上述任何资料和资源，或根据上述资料和资源制作成任何种类物品。
        2、本网站授予用户不可转移及非专属的使用权，使用户可以通过单机计算机使用本网站的目标代码（以下简称"软件"），但用户不得且不得允许任何第三方，复制、修改、创作衍生作品、进行还原工程、反向组译，或以其它方式破译或试图破译源代码，或出售、转让"软件"或对"软件 
        "进行再授权，或以其它方式移转"软件"之任何权利。用户同意不以任何方式修改"软件"，或使用修改后的"软件"。
        3、用户不得经由非本网站所提供的界面使用本网站。
        九、不可抗力
        因不可抗力或者其他意外事件，使得本协议的履行不可能、不必要或者无意义的，双方均不承担责任。本合同所称之不可抗力意指不能预见、不能避免并不能克服的客观情况，包括但不限于战争、台风、水灾、火灾、雷击或地震、罢工、暴动、法定疾病、黑客攻击、网络病毒、电信部门技术管制、政府行为或任何其它自然或人为造成的灾难等客观情况。
        十、争议解决方式
        1、本协议及其修订本的有效性、履行和与本协议及其修订本效力有关的所有事宜，将受中华人民共和国法律管辖，任何争议仅适用中华人民共和国法律。
        2、因使用本网站服务所引起与本网站的任何争议，均应提交相应官方仲裁机关进行仲裁。相关争议应单独仲裁，不得与任何其它方的争议在任何仲裁中合并处理，该仲裁裁决是终局，对各方均有约束力。如果所涉及的争议不适于仲裁解决，用户同意一切争议由北京市法院管辖。
        本协议可由本网站随时修订，并将修订后的协议公告于本网站之上，修订后的条款内容自公告时起生效，并成为本协议的一部分。`
        return up;
    }
    
}